performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 2
      arrivalRate: 1
      name: "Phase 1"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-Type: application/json
  processor: "./my-functions.js"
scenarios:
  - name: "todoist API all requests scenario"
    weight: 1/2
    flow:
      - log: "todoist API all requests scenario"
      - get:
          url: "/rest/v1/tasks"
          capture:
            - json: "$.status"
              as: "get_tasks_status"
      - function: "generateRandomData"
      - post:
          url: "/rest/v1/tasks"
          json:
            content: "{{ taskAction }}"
            due_string: "{{ taskDue }}"
            due_lang: "{{ taskLang }}"
            priority: "{{ taskPriority }}"
          capture:
            - json: "$.id"
              as: "id"
            - json: "$.content"
              as: content
      - log: "Task ID {{ id }}, {{ content }}"
      - get:
          url: "/rest/v1/tasks/{{ id }}"
      - function: "generateNewRandomData"
      - post:
          url: "/rest/v1/tasks/{{ id }}"
          json:
            content: {{ taskNewAction }}
            priority: {{ taskNewPriority }}
      - log: "Updated task with  {{ taskNewAction }}, {{ taskNewPriority }}"
      - post:
          url: "/rest/v1/tasks/{{ id }}/close"
      - post:
          url: "/rest/v1/tasks/{{ id }}/reopen"
      - delete:
          url: "/rest/v1/tasks/{{ id }}"
  - name: "Real Scenario for todoist API"
    weight: 1/2
    flow:
      - log: "Real scenario for todoist API"
      - get:
          url: "/rest/v1/tasks"
# For more information: https://artillery.io/docs/script-reference/

# For more information: https://artillery.io/docs/script-reference/