performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Phase 1"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-Type: application/json
  # processor: "./myProcessor.js"
scenarios:
  - flow:
      - log: "Starting..."
      - get:
          url: "/rest/v1/tasks"
          capture:
            - json: "$.status"
              as: "get_tasks_status"
      - post:
          url: "/rest/v1/tasks"
          json:
            content: Buy garnachas
            due_string: tomorrow at 21:00
            due_lang: en
            priority: 4
          capture:
            - json: "$.id"
              as: "id"
            - json: "$.content"
              as: content
            - json: "$.status"
              as: "create_tasks_status"
      - log: "Task ID {{ id }}, {{ content }}"
      - get:
          url: "/rest/v1/tasks/{{ id }}"
          capture:
            - json: "$.status"
              as: "get_task_status"
      - log: "Get task status {{ get_task_status }}"
      - post:
          url: "/rest/v1/tasks/{{ id }}"
          json:
            content: Buy chalupas
            priority: 3
          capture:
            - json: "$.status"
              as: "update_task_status"
      - log: "Update task status {{ update_task_status }}"
      - post:
          url: "/rest/v1/tasks/{{ id }}/close"
      - post:
          url: "/rest/v1/tasks/{{ id }}/reopen"
      - delete:
          url: "/rest/v1/tasks/{{ id }}/"
# For more information: https://artillery.io/docs/script-reference/